----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 48, 56, 56]           2,352
         LayerNorm-2             [-1, 3136, 48]              96
        PatchEmbed-3             [-1, 3136, 48]               0
           Dropout-4             [-1, 3136, 48]               0
         LayerNorm-5             [-1, 3136, 48]              96
            Linear-6              [-1, 49, 144]           7,056
           Softmax-7            [-1, 1, 49, 49]               0
           Dropout-8            [-1, 1, 49, 49]               0
            Linear-9               [-1, 49, 48]           2,352
          Dropout-10               [-1, 49, 48]               0
  WindowAttention-11               [-1, 49, 48]               0
         Identity-12             [-1, 3136, 48]               0
        LayerNorm-13             [-1, 3136, 48]              96
           Linear-14            [-1, 3136, 192]           9,408
             ReLU-15            [-1, 3136, 192]               0
          Dropout-16            [-1, 3136, 192]               0
           Linear-17             [-1, 3136, 48]           9,264
          Dropout-18             [-1, 3136, 48]               0
              Mlp-19             [-1, 3136, 48]               0
         Identity-20             [-1, 3136, 48]               0
SwinTransformerBlock-21             [-1, 3136, 48]               0
        LayerNorm-22             [-1, 3136, 48]              96
           Linear-23              [-1, 49, 144]           7,056
          Softmax-24            [-1, 1, 49, 49]               0
          Dropout-25            [-1, 1, 49, 49]               0
           Linear-26               [-1, 49, 48]           2,352
          Dropout-27               [-1, 49, 48]               0
  WindowAttention-28               [-1, 49, 48]               0
         DropPath-29             [-1, 3136, 48]               0
        LayerNorm-30             [-1, 3136, 48]              96
           Linear-31            [-1, 3136, 192]           9,408
             ReLU-32            [-1, 3136, 192]               0
          Dropout-33            [-1, 3136, 192]               0
           Linear-34             [-1, 3136, 48]           9,264
          Dropout-35             [-1, 3136, 48]               0
              Mlp-36             [-1, 3136, 48]               0
         DropPath-37             [-1, 3136, 48]               0
SwinTransformerBlock-38             [-1, 3136, 48]               0
        LayerNorm-39             [-1, 784, 192]             384
           Linear-40              [-1, 784, 96]          18,432
     PatchMerging-41              [-1, 784, 96]               0
       BasicLayer-42              [-1, 784, 96]               0
        LayerNorm-43              [-1, 784, 96]             192
           Linear-44              [-1, 49, 288]          27,936
          Softmax-45            [-1, 2, 49, 49]               0
          Dropout-46            [-1, 2, 49, 49]               0
           Linear-47               [-1, 49, 96]           9,312
          Dropout-48               [-1, 49, 96]               0
  WindowAttention-49               [-1, 49, 96]               0
         DropPath-50              [-1, 784, 96]               0
        LayerNorm-51              [-1, 784, 96]             192
           Linear-52             [-1, 784, 384]          37,248
             ReLU-53             [-1, 784, 384]               0
          Dropout-54             [-1, 784, 384]               0
           Linear-55              [-1, 784, 96]          36,960
          Dropout-56              [-1, 784, 96]               0
              Mlp-57              [-1, 784, 96]               0
         DropPath-58              [-1, 784, 96]               0
SwinTransformerBlock-59              [-1, 784, 96]               0
        LayerNorm-60              [-1, 784, 96]             192
           Linear-61              [-1, 49, 288]          27,936
          Softmax-62            [-1, 2, 49, 49]               0
          Dropout-63            [-1, 2, 49, 49]               0
           Linear-64               [-1, 49, 96]           9,312
          Dropout-65               [-1, 49, 96]               0
  WindowAttention-66               [-1, 49, 96]               0
         DropPath-67              [-1, 784, 96]               0
        LayerNorm-68              [-1, 784, 96]             192
           Linear-69             [-1, 784, 384]          37,248
             ReLU-70             [-1, 784, 384]               0
          Dropout-71             [-1, 784, 384]               0
           Linear-72              [-1, 784, 96]          36,960
          Dropout-73              [-1, 784, 96]               0
              Mlp-74              [-1, 784, 96]               0
         DropPath-75              [-1, 784, 96]               0
SwinTransformerBlock-76              [-1, 784, 96]               0
        LayerNorm-77             [-1, 196, 384]             768
           Linear-78             [-1, 196, 192]          73,728
     PatchMerging-79             [-1, 196, 192]               0
       BasicLayer-80             [-1, 196, 192]               0
        LayerNorm-81             [-1, 196, 192]             384
           Linear-82              [-1, 49, 576]         111,168
          Softmax-83            [-1, 4, 49, 49]               0
          Dropout-84            [-1, 4, 49, 49]               0
           Linear-85              [-1, 49, 192]          37,056
          Dropout-86              [-1, 49, 192]               0
  WindowAttention-87              [-1, 49, 192]               0
         DropPath-88             [-1, 196, 192]               0
        LayerNorm-89             [-1, 196, 192]             384
           Linear-90             [-1, 196, 768]         148,224
             ReLU-91             [-1, 196, 768]               0
          Dropout-92             [-1, 196, 768]               0
           Linear-93             [-1, 196, 192]         147,648
          Dropout-94             [-1, 196, 192]               0
              Mlp-95             [-1, 196, 192]               0
         DropPath-96             [-1, 196, 192]               0
SwinTransformerBlock-97             [-1, 196, 192]               0
        LayerNorm-98             [-1, 196, 192]             384
           Linear-99              [-1, 49, 576]         111,168
         Softmax-100            [-1, 4, 49, 49]               0
         Dropout-101            [-1, 4, 49, 49]               0
          Linear-102              [-1, 49, 192]          37,056
         Dropout-103              [-1, 49, 192]               0
 WindowAttention-104              [-1, 49, 192]               0
        DropPath-105             [-1, 196, 192]               0
       LayerNorm-106             [-1, 196, 192]             384
          Linear-107             [-1, 196, 768]         148,224
            ReLU-108             [-1, 196, 768]               0
         Dropout-109             [-1, 196, 768]               0
          Linear-110             [-1, 196, 192]         147,648
         Dropout-111             [-1, 196, 192]               0
             Mlp-112             [-1, 196, 192]               0
        DropPath-113             [-1, 196, 192]               0
SwinTransformerBlock-114             [-1, 196, 192]               0
       LayerNorm-115              [-1, 49, 768]           1,536
          Linear-116              [-1, 49, 384]         294,912
    PatchMerging-117              [-1, 49, 384]               0
      BasicLayer-118              [-1, 49, 384]               0
       LayerNorm-119              [-1, 49, 384]             768
          Linear-120             [-1, 49, 1152]         443,520
         Softmax-121            [-1, 8, 49, 49]               0
         Dropout-122            [-1, 8, 49, 49]               0
          Linear-123              [-1, 49, 384]         147,840
         Dropout-124              [-1, 49, 384]               0
 WindowAttention-125              [-1, 49, 384]               0
        DropPath-126              [-1, 49, 384]               0
       LayerNorm-127              [-1, 49, 384]             768
          Linear-128             [-1, 49, 1536]         591,360
            ReLU-129             [-1, 49, 1536]               0
         Dropout-130             [-1, 49, 1536]               0
          Linear-131              [-1, 49, 384]         590,208
         Dropout-132              [-1, 49, 384]               0
             Mlp-133              [-1, 49, 384]               0
        DropPath-134              [-1, 49, 384]               0
SwinTransformerBlock-135              [-1, 49, 384]               0
       LayerNorm-136              [-1, 49, 384]             768
          Linear-137             [-1, 49, 1152]         443,520
         Softmax-138            [-1, 8, 49, 49]               0
         Dropout-139            [-1, 8, 49, 49]               0
          Linear-140              [-1, 49, 384]         147,840
         Dropout-141              [-1, 49, 384]               0
 WindowAttention-142              [-1, 49, 384]               0
        DropPath-143              [-1, 49, 384]               0
       LayerNorm-144              [-1, 49, 384]             768
          Linear-145             [-1, 49, 1536]         591,360
            ReLU-146             [-1, 49, 1536]               0
         Dropout-147             [-1, 49, 1536]               0
          Linear-148              [-1, 49, 384]         590,208
         Dropout-149              [-1, 49, 384]               0
             Mlp-150              [-1, 49, 384]               0
        DropPath-151              [-1, 49, 384]               0
SwinTransformerBlock-152              [-1, 49, 384]               0
      BasicLayer-153              [-1, 49, 384]               0
       LayerNorm-154              [-1, 49, 384]             768
          Linear-155              [-1, 49, 768]         294,912
       LayerNorm-156             [-1, 196, 192]             384
     PatchExpand-157             [-1, 196, 192]               0
          Linear-158             [-1, 196, 192]          73,920
       LayerNorm-159             [-1, 196, 192]             384
          Linear-160              [-1, 49, 576]         111,168
         Softmax-161            [-1, 4, 49, 49]               0
         Dropout-162            [-1, 4, 49, 49]               0
          Linear-163              [-1, 49, 192]          37,056
         Dropout-164              [-1, 49, 192]               0
 WindowAttention-165              [-1, 49, 192]               0
        DropPath-166             [-1, 196, 192]               0
       LayerNorm-167             [-1, 196, 192]             384
          Linear-168             [-1, 196, 768]         148,224
            ReLU-169             [-1, 196, 768]               0
         Dropout-170             [-1, 196, 768]               0
          Linear-171             [-1, 196, 192]         147,648
         Dropout-172             [-1, 196, 192]               0
             Mlp-173             [-1, 196, 192]               0
        DropPath-174             [-1, 196, 192]               0
SwinTransformerBlock-175             [-1, 196, 192]               0
       LayerNorm-176             [-1, 196, 192]             384
          Linear-177              [-1, 49, 576]         111,168
         Softmax-178            [-1, 4, 49, 49]               0
         Dropout-179            [-1, 4, 49, 49]               0
          Linear-180              [-1, 49, 192]          37,056
         Dropout-181              [-1, 49, 192]               0
 WindowAttention-182              [-1, 49, 192]               0
        DropPath-183             [-1, 196, 192]               0
       LayerNorm-184             [-1, 196, 192]             384
          Linear-185             [-1, 196, 768]         148,224
            ReLU-186             [-1, 196, 768]               0
         Dropout-187             [-1, 196, 768]               0
          Linear-188             [-1, 196, 192]         147,648
         Dropout-189             [-1, 196, 192]               0
             Mlp-190             [-1, 196, 192]               0
        DropPath-191             [-1, 196, 192]               0
SwinTransformerBlock-192             [-1, 196, 192]               0
          Linear-193             [-1, 196, 384]          73,728
       LayerNorm-194              [-1, 784, 96]             192
     PatchExpand-195              [-1, 784, 96]               0
   BasicLayer_up-196              [-1, 784, 96]               0
          Linear-197              [-1, 784, 96]          18,528
       LayerNorm-198              [-1, 784, 96]             192
          Linear-199              [-1, 49, 288]          27,936
         Softmax-200            [-1, 2, 49, 49]               0
         Dropout-201            [-1, 2, 49, 49]               0
          Linear-202               [-1, 49, 96]           9,312
         Dropout-203               [-1, 49, 96]               0
 WindowAttention-204               [-1, 49, 96]               0
        DropPath-205              [-1, 784, 96]               0
       LayerNorm-206              [-1, 784, 96]             192
          Linear-207             [-1, 784, 384]          37,248
            ReLU-208             [-1, 784, 384]               0
         Dropout-209             [-1, 784, 384]               0
          Linear-210              [-1, 784, 96]          36,960
         Dropout-211              [-1, 784, 96]               0
             Mlp-212              [-1, 784, 96]               0
        DropPath-213              [-1, 784, 96]               0
SwinTransformerBlock-214              [-1, 784, 96]               0
       LayerNorm-215              [-1, 784, 96]             192
          Linear-216              [-1, 49, 288]          27,936
         Softmax-217            [-1, 2, 49, 49]               0
         Dropout-218            [-1, 2, 49, 49]               0
          Linear-219               [-1, 49, 96]           9,312
         Dropout-220               [-1, 49, 96]               0
 WindowAttention-221               [-1, 49, 96]               0
        DropPath-222              [-1, 784, 96]               0
       LayerNorm-223              [-1, 784, 96]             192
          Linear-224             [-1, 784, 384]          37,248
            ReLU-225             [-1, 784, 384]               0
         Dropout-226             [-1, 784, 384]               0
          Linear-227              [-1, 784, 96]          36,960
         Dropout-228              [-1, 784, 96]               0
             Mlp-229              [-1, 784, 96]               0
        DropPath-230              [-1, 784, 96]               0
SwinTransformerBlock-231              [-1, 784, 96]               0
          Linear-232             [-1, 784, 192]          18,432
       LayerNorm-233             [-1, 3136, 48]              96
     PatchExpand-234             [-1, 3136, 48]               0
   BasicLayer_up-235             [-1, 3136, 48]               0
          Linear-236             [-1, 3136, 48]           4,656
       LayerNorm-237             [-1, 3136, 48]              96
          Linear-238              [-1, 49, 144]           7,056
         Softmax-239            [-1, 1, 49, 49]               0
         Dropout-240            [-1, 1, 49, 49]               0
          Linear-241               [-1, 49, 48]           2,352
         Dropout-242               [-1, 49, 48]               0
 WindowAttention-243               [-1, 49, 48]               0
        Identity-244             [-1, 3136, 48]               0
       LayerNorm-245             [-1, 3136, 48]              96
          Linear-246            [-1, 3136, 192]           9,408
            ReLU-247            [-1, 3136, 192]               0
         Dropout-248            [-1, 3136, 192]               0
          Linear-249             [-1, 3136, 48]           9,264
         Dropout-250             [-1, 3136, 48]               0
             Mlp-251             [-1, 3136, 48]               0
        Identity-252             [-1, 3136, 48]               0
SwinTransformerBlock-253             [-1, 3136, 48]               0
       LayerNorm-254             [-1, 3136, 48]              96
          Linear-255              [-1, 49, 144]           7,056
         Softmax-256            [-1, 1, 49, 49]               0
         Dropout-257            [-1, 1, 49, 49]               0
          Linear-258               [-1, 49, 48]           2,352
         Dropout-259               [-1, 49, 48]               0
 WindowAttention-260               [-1, 49, 48]               0
        DropPath-261             [-1, 3136, 48]               0
       LayerNorm-262             [-1, 3136, 48]              96
          Linear-263            [-1, 3136, 192]           9,408
            ReLU-264            [-1, 3136, 192]               0
         Dropout-265            [-1, 3136, 192]               0
          Linear-266             [-1, 3136, 48]           9,264
         Dropout-267             [-1, 3136, 48]               0
             Mlp-268             [-1, 3136, 48]               0
        DropPath-269             [-1, 3136, 48]               0
SwinTransformerBlock-270             [-1, 3136, 48]               0
   BasicLayer_up-271             [-1, 3136, 48]               0
       LayerNorm-272             [-1, 3136, 48]              96
          Linear-273            [-1, 3136, 768]          36,864
       LayerNorm-274            [-1, 50176, 48]              96
FinalPatchExpand_X4-275            [-1, 50176, 48]               0
          Conv2d-276          [-1, 1, 224, 224]              48
          Conv2d-277          [-1, 1, 224, 224]              48
          Conv2d-278          [-1, 1, 224, 224]              48
          Conv2d-279          [-1, 1, 224, 224]              48
================================================================
Total params: 6,803,904
Trainable params: 6,803,904
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 251.49
Params size (MB): 25.95
Estimated Total Size (MB): 278.02
----------------------------------------------------------------
